# Assignment3 Q1 P2

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Data/vehicle_collisions.csv')

In [3]:
df1 = df[['BOROUGH', 'VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE', 'VEHICLE 4 TYPE', 'VEHICLE 5 TYPE']]

In [4]:
df2 = df1.copy()
df2['CARCOUNT'] = df2.apply(lambda x:x.count() - 1, axis=1)
df2 = df2.dropna(subset=['BOROUGH'])

In [5]:
df3 = df2[['BOROUGH', 'CARCOUNT']]
df3.head()

    BOROUGH  CARCOUNT
0    QUEENS         1
2  BROOKLYN         2
3  BROOKLYN         2
5  BROOKLYN         4
6    QUEENS         3

In [66]:
df4 = df3.groupby(['BOROUGH'])

In [67]:
df5.columns = ['NUMBER']
df5

                        NUMBER
BOROUGH       CARCOUNT
BRONX         0            525
              1           8627
              2          34385
              3           1962
              4            452
              5            173
BROOKLYN      0            787
              1          17375
              2          80207
              3           4980
              4           1151
              5            461
MANHATTAN     0            801
              1          13318
              2          66958
              3           2024
              4            372
              5            129
QUEENS        0            515
              1          12962
              2          70260
              3           4498
              4           1106
              5            314
STATEN ISLAND 0            105
              1           2343
              2          10676
              3            759
              4            133
              5             32

In [68]:
df6 = df5.copy()
df6 = df6.T
df6

BOROUGH  BRONX                              BROOKLYN                     ...  \
CARCOUNT     0     1      2     3    4    5        0      1      2     3 ...
NUMBER     525  8627  34385  1962  452  173      787  17375  80207  4980 ...

BOROUGH  QUEENS                  STATEN ISLAND
CARCOUNT      2     3     4    5             0     1      2    3    4   5
NUMBER    70260  4498  1106  314           105  2343  10676  759  133  32

[1 rows x 30 columns]

In [71]:
df6.to_csv('Assignment3Q1P2.csv')